In [21]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Matplotlib is building the font cache; this may take a moment.

In [ ]:
df = pd.read_csv('application_data.csv')

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
# listing all columns
list(df)

# **for filtering out columns**
- I opened the output of the list(df) into a text element, copied that and put it in a text file (bc it was read-only), then **removed** the columns I wanted to **keep**, then copied the resulting list into columns_to_drop

In [48]:
# dropping columns and creating new datafram
columns_to_drop = ['OWN_CAR_AGE', 
'FLAG_MOBIL',
 'FLAG_EMP_PHONE',
 'FLAG_CONT_MOBILE',
 'FLAG_PHONE',
 'FLAG_EMAIL',
 'EXT_SOURCE_1',
 'EXT_SOURCE_2',
 'EXT_SOURCE_3',
 'APARTMENTS_AVG',
 'BASEMENTAREA_AVG',
 'YEARS_BEGINEXPLUATATION_AVG',
 'YEARS_BUILD_AVG',
 'COMMONAREA_AVG',
 'ELEVATORS_AVG',
 'ENTRANCES_AVG',
 'FLOORSMAX_AVG',
 'FLOORSMIN_AVG',
 'LANDAREA_AVG',
 'LIVINGAPARTMENTS_AVG',
 'LIVINGAREA_AVG',
 'NONLIVINGAPARTMENTS_AVG',
 'NONLIVINGAREA_AVG',
 'APARTMENTS_MODE',
 'BASEMENTAREA_MODE',
 'YEARS_BEGINEXPLUATATION_MODE',
 'YEARS_BUILD_MODE',
 'COMMONAREA_MODE',
 'ELEVATORS_MODE',
 'ENTRANCES_MODE',
 'FLOORSMAX_MODE',
 'FLOORSMIN_MODE',
 'LANDAREA_MODE',
 'LIVINGAPARTMENTS_MODE',
 'LIVINGAREA_MODE',
 'NONLIVINGAPARTMENTS_MODE',
 'NONLIVINGAREA_MODE',
 'APARTMENTS_MEDI',
 'BASEMENTAREA_MEDI',
 'YEARS_BEGINEXPLUATATION_MEDI',
 'YEARS_BUILD_MEDI',
 'COMMONAREA_MEDI',
 'ELEVATORS_MEDI',
 'ENTRANCES_MEDI',
 'FLOORSMAX_MEDI',
 'FLOORSMIN_MEDI',
 'LANDAREA_MEDI',
 'LIVINGAPARTMENTS_MEDI',
 'LIVINGAREA_MEDI',
 'NONLIVINGAPARTMENTS_MEDI',
 'NONLIVINGAREA_MEDI',
 'FONDKAPREMONT_MODE',
 'HOUSETYPE_MODE',
 'TOTALAREA_MODE',
 'WALLSMATERIAL_MODE',
 'EMERGENCYSTATE_MODE',
 'FLAG_DOCUMENT_2',
 'FLAG_DOCUMENT_3',
 'FLAG_DOCUMENT_4',
 'FLAG_DOCUMENT_5',
 'FLAG_DOCUMENT_6',
 'FLAG_DOCUMENT_7',
 'FLAG_DOCUMENT_8',
 'FLAG_DOCUMENT_9',
 'FLAG_DOCUMENT_10',
 'FLAG_DOCUMENT_11',
 'FLAG_DOCUMENT_12',
 'FLAG_DOCUMENT_13',
 'FLAG_DOCUMENT_14',
 'FLAG_DOCUMENT_15',
 'FLAG_DOCUMENT_16',
 'FLAG_DOCUMENT_17',
 'FLAG_DOCUMENT_18',
 'FLAG_DOCUMENT_19',
 'FLAG_DOCUMENT_20',
 'FLAG_DOCUMENT_21']
df_dropped = df.drop(columns=columns_to_drop)
list(df_dropped)

['SK_ID_CURR',
 'TARGET',
 'NAME_CONTRACT_TYPE',
 'CODE_GENDER',
 'FLAG_OWN_CAR',
 'FLAG_OWN_REALTY',
 'CNT_CHILDREN',
 'AMT_INCOME_TOTAL',
 'AMT_CREDIT',
 'AMT_ANNUITY',
 'AMT_GOODS_PRICE',
 'NAME_TYPE_SUITE',
 'NAME_INCOME_TYPE',
 'NAME_EDUCATION_TYPE',
 'NAME_FAMILY_STATUS',
 'NAME_HOUSING_TYPE',
 'REGION_POPULATION_RELATIVE',
 'DAYS_BIRTH',
 'DAYS_EMPLOYED',
 'DAYS_REGISTRATION',
 'DAYS_ID_PUBLISH',
 'FLAG_WORK_PHONE',
 'OCCUPATION_TYPE',
 'CNT_FAM_MEMBERS',
 'REGION_RATING_CLIENT',
 'REGION_RATING_CLIENT_W_CITY',
 'WEEKDAY_APPR_PROCESS_START',
 'HOUR_APPR_PROCESS_START',
 'REG_REGION_NOT_LIVE_REGION',
 'REG_REGION_NOT_WORK_REGION',
 'LIVE_REGION_NOT_WORK_REGION',
 'REG_CITY_NOT_LIVE_CITY',
 'REG_CITY_NOT_WORK_CITY',
 'LIVE_CITY_NOT_WORK_CITY',
 'ORGANIZATION_TYPE',
 'OBS_30_CNT_SOCIAL_CIRCLE',
 'DEF_30_CNT_SOCIAL_CIRCLE',
 'OBS_60_CNT_SOCIAL_CIRCLE',
 'DEF_60_CNT_SOCIAL_CIRCLE',
 'DAYS_LAST_PHONE_CHANGE',
 'AMT_REQ_CREDIT_BUREAU_HOUR',
 'AMT_REQ_CREDIT_BUREAU_DAY',
 'AMT_REQ_CREDIT_BUREAU_WEEK',
 'AMT_REQ_CREDIT_BUREAU_MON',
 'AMT_REQ_CREDIT_BUREAU_QRT',
 'AMT_REQ_CREDIT_BUREAU_YEAR']

In [22]:
list(df_dropped)

['SK_ID_CURR',
 'TARGET',
 'NAME_CONTRACT_TYPE',
 'CODE_GENDER',
 'FLAG_OWN_CAR',
 'FLAG_OWN_REALTY',
 'CNT_CHILDREN',
 'AMT_INCOME_TOTAL',
 'AMT_CREDIT',
 'AMT_ANNUITY',
 'AMT_GOODS_PRICE',
 'NAME_TYPE_SUITE',
 'NAME_INCOME_TYPE',
 'NAME_EDUCATION_TYPE',
 'NAME_FAMILY_STATUS',
 'NAME_HOUSING_TYPE',
 'REGION_POPULATION_RELATIVE',
 'DAYS_BIRTH',
 'DAYS_EMPLOYED',
 'DAYS_REGISTRATION',
 'DAYS_ID_PUBLISH',
 'OWN_CAR_AGE',
 'FLAG_WORK_PHONE',
 'OCCUPATION_TYPE',
 'CNT_FAM_MEMBERS',
 'REGION_RATING_CLIENT',
 'REGION_RATING_CLIENT_W_CITY',
 'WEEKDAY_APPR_PROCESS_START',
 'HOUR_APPR_PROCESS_START',
 'REG_REGION_NOT_LIVE_REGION',
 'REG_REGION_NOT_WORK_REGION',
 'LIVE_REGION_NOT_WORK_REGION',
 'REG_CITY_NOT_LIVE_CITY',
 'REG_CITY_NOT_WORK_CITY',
 'LIVE_CITY_NOT_WORK_CITY',
 'ORGANIZATION_TYPE',
 'OBS_30_CNT_SOCIAL_CIRCLE',
 'DEF_30_CNT_SOCIAL_CIRCLE',
 'OBS_60_CNT_SOCIAL_CIRCLE',
 'DEF_60_CNT_SOCIAL_CIRCLE',
 'DAYS_LAST_PHONE_CHANGE',
 'AMT_REQ_CREDIT_BUREAU_HOUR',
 'AMT_REQ_CREDIT_BUREAU_DAY',
 'AMT_REQ_CREDIT_BUREAU_WEEK',
 'AMT_REQ_CREDIT_BUREAU_MON',
 'AMT_REQ_CREDIT_BUREAU_QRT',
 'AMT_REQ_CREDIT_BUREAU_YEAR']

In [ ]:
# checking for null values
df_dropped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307511 entries, 0 to 307510
Data columns (total 47 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   SK_ID_CURR                   307511 non-null  int64
 1   TARGET                       307511 non-null  int64
 2   NAME_CONTRACT_TYPE           307511 non-null  object
 3   CODE_GENDER                  307511 non-null  object
 4   FLAG_OWN_CAR                 307511 non-null  object
 5   FLAG_OWN_REALTY              307511 non-null  object
 6   CNT_CHILDREN                 307511 non-null  int64
 7   AMT_INCOME_TOTAL             307511 non-null  float64
 8   AMT_CREDIT                   307511 non-null  float64
 9   AMT_ANNUITY                  307499 non-null  float64
 10  AMT_GOODS_PRICE              307233 non-null  float64
 11  NAME_TYPE_SUITE              306219 non-null  object
 12  NAME_INCOME_TYPE             307511 non-null  object
 13  NAME_EDUCATION_TYPE          307511 non-null  object
 14  NAME_FAMILY_STATUS           307511 non-null  object
 15  NAME_HOUSING_TYPE            307511 non-null  object
 16  REGION_POPULATION_RELATIVE   307511 non-null  float64
 17  DAYS_BIRTH                   307511 non-null  int64
 18  DAYS_EMPLOYED                307511 non-null  int64
 19  DAYS_REGISTRATION            307511 non-null  float64
 20  DAYS_ID_PUBLISH              307511 non-null  int64
 21  OWN_CAR_AGE                  104582 non-null  float64
 22  FLAG_WORK_PHONE              307511 non-null  int64
 23  OCCUPATION_TYPE              211120 non-null  object
 24  CNT_FAM_MEMBERS              307509 non-null  float64
 25  REGION_RATING_CLIENT         307511 non-null  int64
 26  REGION_RATING_CLIENT_W_CITY  307511 non-null  int64
 27  WEEKDAY_APPR_PROCESS_START   307511 non-null  object
 28  HOUR_APPR_PROCESS_START      307511 non-null  int64
 29  REG_REGION_NOT_LIVE_REGION   307511 non-null  int64
 30  REG_REGION_NOT_WORK_REGION   307511 non-null  int64
 31  LIVE_REGION_NOT_WORK_REGION  307511 non-null  int64
 32  REG_CITY_NOT_LIVE_CITY       307511 non-null  int64
 33  REG_CITY_NOT_WORK_CITY       307511 non-null  int64
 34  LIVE_CITY_NOT_WORK_CITY      307511 non-null  int64
 35  ORGANIZATION_TYPE            307511 non-null  object
 36  OBS_30_CNT_SOCIAL_CIRCLE     306490 non-null  float64
 37  DEF_30_CNT_SOCIAL_CIRCLE     306490 non-null  float64
 38  OBS_60_CNT_SOCIAL_CIRCLE     306490 non-null  float64
 39  DEF_60_CNT_SOCIAL_CIRCLE     306490 non-null  float64
 40  DAYS_LAST_PHONE_CHANGE       307510 non-null  float64
 41  AMT_REQ_CREDIT_BUREAU_HOUR   265992 non-null  float64
 42  AMT_REQ_CREDIT_BUREAU_DAY    265992 non-null  float64
 43  AMT_REQ_CREDIT_BUREAU_WEEK   265992 non-null  float64
 44  AMT_REQ_CREDIT_BUREAU_MON    265992 non-null  float64
 45  AMT_REQ_CREDIT_BUREAU_QRT    265992 non-null  float64
 46  AMT_REQ_CREDIT_BUREAU_YEAR   265992 non-null  float64
dtypes: float64(19), int64(16), object(12)
memory usage: 110.3+ MB

In [29]:
# determining the amount of clients with trouble making payments 
df_dropped['TARGET'].value_counts()

TARGET
0    282686
1     24825
Name: count, dtype: int64

In [31]:
24825 / 307510 * 100

8.07290819810738

# **Intial Thoughts**

 - it seems like there are some null values in OWN_AGE_CAR, OCCUPATION_TYPE, AMT_REQ_CREDIT(many columns)
    - client may not own a car
    - people might not have a previous application to reference
 - datatypes are a mix of integers, floats, and objects (strings)
 - clients who have trouble paying represent ~8% of the dataset

In [40]:
df_dropped[['TARGET', 
 'CNT_CHILDREN',
 'AMT_INCOME_TOTAL',
 'AMT_CREDIT',
 'AMT_ANNUITY',
 'AMT_GOODS_PRICE']].groupby(['TARGET']).mean()

,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,AMT_GOODS_PRICE
TARGET,,,,,
0,0.412946,169077.722266,602648.282002,27163.623349,542736.795003
1,0.463807,165611.760906,557778.527674,26481.744290,488972.412554

In [ ]:
# aggregated table for children, income, credit, annuity, loan amt
df_dropped.groupby(['TARGET']).agg(
    {'CNT_CHILDREN': ['mean', 'median', 'min', 'max'],
 'AMT_INCOME_TOTAL': ['mean', 'median', 'min', 'max'],
 'AMT_CREDIT': ['mean', 'median', 'min', 'max'],
 'AMT_ANNUITY': ['mean', 'median', 'min', 'max'],
 'AMT_GOODS_PRICE': ['mean', 'median', 'min', 'max']})

       CNT_CHILDREN                AMT_INCOME_TOTAL                     \
               mean median min max             mean    median      min
TARGET
0          0.412946    0.0   0  19    169077.722266  148500.0  25650.0
1          0.463807    0.0   0  11    165611.760906  135000.0  25650.0

                        AMT_CREDIT                                \
                max           mean    median      min        max
TARGET
0        18000090.0  602648.282002  517788.0  45000.0  4050000.0
1       117000000.0  557778.527674  497520.0  45000.0  4027680.0

         AMT_ANNUITY                            AMT_GOODS_PRICE            \
                mean   median     min       max            mean    median
TARGET
0       27163.623349  24876.0  1615.5  258025.5   542736.795003  450000.0
1       26481.744290  25263.0  2722.5  149211.0   488972.412554  450000.0


            min        max
TARGET
0       40500.0  4050000.0
1       45000.0  3600000.0

** note to self: when referencing multiple columns from df you need double brackets

# ** insights **
- im gonna call clients with trouble making payments "defaulters"
- from the mean: defaulters have more children, lower total income, lower credit, lower annuity, and lowers goods price 
- total income max for defaulters seems a bit high

In [36]:
df_dropped[['TARGET', 
 'OBS_30_CNT_SOCIAL_CIRCLE',
 'DEF_30_CNT_SOCIAL_CIRCLE',
 'OBS_60_CNT_SOCIAL_CIRCLE',
 'DEF_60_CNT_SOCIAL_CIRCLE',]].groupby(['TARGET']).mean()

,OBS_30_CNT_SOCIAL_CIRCLE,DEF_30_CNT_SOCIAL_CIRCLE,OBS_60_CNT_SOCIAL_CIRCLE,DEF_60_CNT_SOCIAL_CIRCLE
TARGET,,,,
0,1.415742,0.139148,1.398923,0.096688
1,1.496147,0.191980,1.477672,0.138247

# I still don't really know what this means ^

In [37]:
df_dropped[['TARGET', 
 'AMT_REQ_CREDIT_BUREAU_HOUR',
 'AMT_REQ_CREDIT_BUREAU_DAY',
 'AMT_REQ_CREDIT_BUREAU_WEEK',
 'AMT_REQ_CREDIT_BUREAU_MON',
 'AMT_REQ_CREDIT_BUREAU_QRT',
 'AMT_REQ_CREDIT_BUREAU_YEAR']].groupby(['TARGET']).mean()

,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
TARGET,,,,,,
0,0.006380,0.006914,0.034315,0.270697,0.265939,1.889199
1,0.006672,0.008036,0.034919,0.227926,0.259923,2.028783

In [38]:
df_dropped[['TARGET', 
 'AMT_REQ_CREDIT_BUREAU_HOUR',
 'AMT_REQ_CREDIT_BUREAU_DAY',
 'AMT_REQ_CREDIT_BUREAU_WEEK',
 'AMT_REQ_CREDIT_BUREAU_MON',
 'AMT_REQ_CREDIT_BUREAU_QRT',
 'AMT_REQ_CREDIT_BUREAU_YEAR']].groupby(['TARGET']).count()

,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
TARGET,,,,,,
0,245459,245459,245459,245459,245459,245459
1,20533,20533,20533,20533,20533,20533

In [ ]:
# looking at occupation types grouped by defaulters and non-defaulters
df_dropped[['TARGET', 'OCCUPATION_TYPE']].groupby(['TARGET']).value_counts()

TARGET  OCCUPATION_TYPE
0       Laborers                 49348
        Sales staff              29010
        Core staff               25832
        Managers                 20043
        Drivers                  16496
        High skill tech staff    10679
        Accountants               9339
        Medicine staff            7965
        Security staff            5999
        Cooking staff             5325
        Cleaning staff            4206
        Private service staff     2477
        Low-skill Laborers        1734
        Secretaries               1213
        Waiters/barmen staff      1196
        Realty agents              692
        HR staff                   527
        IT staff                   492
1       Laborers                  5838
        Sales staff               3092
        Drivers                   2107
        Core staff                1738
        Managers                  1328
        Security staff             722
        High skill tech staff      701
        Cooking staff              621
        Medicine staff             572
        Accountants                474
        Cleaning staff             447
        Low-skill Laborers         359
        Private service staff      175
        Waiters/barmen staff       152
        Secretaries                 92
        Realty agents               59
        HR staff                    36
        IT staff                    34
Name: count, dtype: int64

In [45]:
df_defaulters_only = df_dropped[df_dropped['TARGET'] == 1]

In [46]:
df_defaulters_only

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,DEF_30_CNT_SOCIAL_CIRCLE,OBS_60_CNT_SOCIAL_CIRCLE,DEF_60_CNT_SOCIAL_CIRCLE,DAYS_LAST_PHONE_CHANGE,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,2.0,2.0,2.0,-1134.0,0.0,0.0,0.0,0.0,0.0,1.0
26,100031,1,Cash loans,F,N,Y,0,112500.0,979992.0,27076.5,...,1.0,10.0,0.0,-161.0,0.0,0.0,0.0,0.0,2.0,2.0
40,100047,1,Cash loans,M,N,Y,0,202500.0,1193580.0,35028.0,...,0.0,0.0,0.0,-1075.0,0.0,0.0,0.0,2.0,0.0,4.0
42,100049,1,Cash loans,F,N,N,0,135000.0,288873.0,16258.5,...,0.0,1.0,0.0,-1480.0,0.0,0.0,0.0,0.0,0.0,2.0
81,100096,1,Cash loans,F,N,Y,0,81000.0,252000.0,14593.5,...,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
307448,456186,1,Cash loans,M,N,N,1,207000.0,450000.0,32746.5,...,0.0,0.0,0.0,-324.0,0.0,0.0,0.0,0.0,0.0,2.0
307475,456215,1,Cash loans,F,N,N,1,144000.0,1303200.0,46809.0,...,0.0,0.0,0.0,-1492.0,0.0,0.0,0.0,1.0,0.0,6.0
307481,456225,1,Cash loans,M,N,Y,0,225000.0,297000.0,19975.5,...,0.0,0.0,0.0,-2941.0,0.0,0.0,0.0,0.0,0.0,3.0
307489,456233,1,Cash loans,F,N,Y,0,225000.0,521280.0,23089.5,...,1.0,1.0,0.0,-307.0,0.0,0.0,0.0,0.0,1.0,2.0
307509,456254,1,Cash loans,F,N,Y,0,171000.0,370107.0,20205.0,...,0.0,0.0,0.0,-322.0,0.0,0.0,0.0,0.0,0.0,0.0

In [47]:
df_defaulters_only.info()

<class 'pandas.core.frame.DataFrame'>
Index: 24825 entries, 0 to 307509
Data columns (total 47 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   SK_ID_CURR                   24825 non-null  int64
 1   TARGET                       24825 non-null  int64
 2   NAME_CONTRACT_TYPE           24825 non-null  object
 3   CODE_GENDER                  24825 non-null  object
 4   FLAG_OWN_CAR                 24825 non-null  object
 5   FLAG_OWN_REALTY              24825 non-null  object
 6   CNT_CHILDREN                 24825 non-null  int64
 7   AMT_INCOME_TOTAL             24825 non-null  float64
 8   AMT_CREDIT                   24825 non-null  float64
 9   AMT_ANNUITY                  24825 non-null  float64
 10  AMT_GOODS_PRICE              24804 non-null  float64
 11  NAME_TYPE_SUITE              24755 non-null  object
 12  NAME_INCOME_TYPE             24825 non-null  object
 13  NAME_EDUCATION_TYPE          24825 non-null  object
 14  NAME_FAMILY_STATUS           24825 non-null  object
 15  NAME_HOUSING_TYPE            24825 non-null  object
 16  REGION_POPULATION_RELATIVE   24825 non-null  float64
 17  DAYS_BIRTH                   24825 non-null  int64
 18  DAYS_EMPLOYED                24825 non-null  int64
 19  DAYS_REGISTRATION            24825 non-null  float64
 20  DAYS_ID_PUBLISH              24825 non-null  int64
 21  OWN_CAR_AGE                  7576 non-null   float64
 22  FLAG_WORK_PHONE              24825 non-null  int64
 23  OCCUPATION_TYPE              18547 non-null  object
 24  CNT_FAM_MEMBERS              24825 non-null  float64
 25  REGION_RATING_CLIENT         24825 non-null  int64
 26  REGION_RATING_CLIENT_W_CITY  24825 non-null  int64
 27  WEEKDAY_APPR_PROCESS_START   24825 non-null  object
 28  HOUR_APPR_PROCESS_START      24825 non-null  int64
 29  REG_REGION_NOT_LIVE_REGION   24825 non-null  int64
 30  REG_REGION_NOT_WORK_REGION   24825 non-null  int64
 31  LIVE_REGION_NOT_WORK_REGION  24825 non-null  int64
 32  REG_CITY_NOT_LIVE_CITY       24825 non-null  int64
 33  REG_CITY_NOT_WORK_CITY       24825 non-null  int64
 34  LIVE_CITY_NOT_WORK_CITY      24825 non-null  int64
 35  ORGANIZATION_TYPE            24825 non-null  object
 36  OBS_30_CNT_SOCIAL_CIRCLE     24789 non-null  float64
 37  DEF_30_CNT_SOCIAL_CIRCLE     24789 non-null  float64
 38  OBS_60_CNT_SOCIAL_CIRCLE     24789 non-null  float64
 39  DEF_60_CNT_SOCIAL_CIRCLE     24789 non-null  float64
 40  DAYS_LAST_PHONE_CHANGE       24825 non-null  float64
 41  AMT_REQ_CREDIT_BUREAU_HOUR   20533 non-null  float64
 42  AMT_REQ_CREDIT_BUREAU_DAY    20533 non-null  float64
 43  AMT_REQ_CREDIT_BUREAU_WEEK   20533 non-null  float64
 44  AMT_REQ_CREDIT_BUREAU_MON    20533 non-null  float64
 45  AMT_REQ_CREDIT_BUREAU_QRT    20533 non-null  float64
 46  AMT_REQ_CREDIT_BUREAU_YEAR   20533 non-null  float64
dtypes: float64(19), int64(16), object(12)
memory usage: 9.1+ MB

In [1]:
df_defaulters_only.head(10)

NameError: name 'df_defaulters_only' is not defined

In [ ]:
df.to_csv('/Users/jacobwarchola/Desktop/archive/loan_application_dropped.csv')